let VPNRanges = externaldata (IpRange: string) [@'https://raw.githubusercontent.com/X4BNet/lists_vpn/main/output/vpn/ipv4.txt'] with (format=txt);
SigninLogs
| where isnotempty(IPAddress)
| evaluate ipv4_lookup(VPNRanges, IPAddress, IpRange)
| join kind=leftouter IdentityInfo on $left.UserPrincipalName == $right.AccountObjectId
| extend Spur = strcat("https://spur.us/context/", IPAddress)
| extend UserPrincipalName = iff(countof(UserPrincipalName,"-") == 4, AccountUPN, UserPrincipalName)
| project TimeGenerated, UserPrincipalName, IPAddress, UserAgent, Spur
