DeviceProcessEvents
| where ProcessCommandLine contains "rundll32.exe C:\\WINDOWS\\system32\\davclnt.dll,DavSetCookie"
| where ProcessCommandLine contains "http" or ProcessCommandLine contains "https"
| where ProcessCommandLine matches regex @"\b\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}\b"
//| where not(ProcessCommandLine contains "10." or ProcessCommandLine contains "172." or ProcessCommandLine contains "192.168")
| project-reorder Timestamp, AccountUpn, ProcessCommandLine