//This query detects attempts to manipulate msDS-KeyCredentialLink attribute using Whisker tool
//Used for taking over AD user and computer accounts via "Shadow Credentials"
//Requires Windows Server 2016+ DC with server authentication certificate
DeviceProcessEvents
| where FileName in ("Whisker.exe")
| where ProcessCommandLine has_all ("/target", "/domain", "/dc")
| where ProcessCommandLine has_any ("add", "remove", "list", "clear")
| project Timestamp, DeviceName, DeviceId, ReportId, ProcessCommandLine, InitiatingProcessCommandLine 