//This query detects attempts to become TrustedInstaller
//Such attempts could allow bypass of ACLs for endpoint tampering
DeviceProcessEvents
| where ProcessCommandLine contains "TrustedInstaller"
| where ProcessCommandLine has_any("config", "sc", "sc.exe", "stop","del","binpath=") 