//This Query detects UrlClickEvents to URLs listed on OpenPhish Database followed by a risky sign in to this Account
//Recommended Action: Mark User as Compromised
let OpenPhish = externaldata (Url: string) ["https://openphish.com/feed.txt"];
UrlClickEvents
| join kind=inner OpenPhish on $left.Url == $right.Url
| project Timestamp, AccountUpn, Url
| join kind=inner AADSignInEventsBeta on $left.AccountUpn == $right.AccountUpn
| where Timestamp > Timestamp1
| where isnotempty(RiskLevelDuringSignIn) 